package arrays;

/**
 * User: User
 * Date: 14.09.17
 * Time: 13:29
 */
/*
Задача:
Как определить дублированный элемент в массиве, в котором содержатся элементы типа int от 1 до 100,
при условии, что в массиве дублируется только один элемент

Решение:
1. Последовательное сравнение
2. - Считаем сумму всех чисел от 1 до 100 любым удобным для Вас методом.
   - Считаем сумму элементов массива.
   - Вычитаем первое из второго. Получаем… Правильно, получаем значение дублирующегося элемента.
   - Если надо, находим номера искомых элементов в массиве.
* */
public class DuplicateElement {

    public static void main(String[] args) {
        int[] arrInt = new int[100];
        for (int i = 1; i < 100; i++) {

        }
    }
}
